# TileBrickType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Tile..::..TileBrickType Property
Tile Class See Also
---
The property labeled "Type" from the "Tile" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string TileBrickType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TileBrickType As String
	Get
```

Visual C++
---
```text
public:
static property String^ TileBrickType {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "TileBrickType".
# See Also
Tile Class
Autodesk.Revit.DB.Visual Namespace